content/feeds.org
#+startup: content indent

* RSS Feed
#+INDEX: Giovanni's Diary!Feeds

[[file:rss-feed-guide.org][RSS feeds]] are generated with my custom generator [[https://github.com/San7o/tiny-rss][tiny-rss]].
I consider this still experimental so expect lots of changes and random
feeds.

If you still want to subscribe, at your own risk, currently those are
the available feeds:
- [[file:feeds/feedSurroundings.rss][Surroundings]]: feed for the Surrounding series, described [[file:reading/surroundings/surroundings.org][here]].
- [[file:feeds/feedEphemeris.rss][Ephemeris]]: feed for my public diary described [[file:ephemeris/ephemeris.org][here]].
- [[file:./feeds/feedProgramming.rss][Programming]]: programming notes.
  
-----

Travel: [[file:index.org][Giovanni's Diary]], [[file:theindex.org][Index]]
