public/feeds.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
</head>
<body>
<div id="content" class="content">
<p>
<a href="index.html">Giovanni's Diary</a> &gt;
</p>

<div id="outline-container-orgad7cbbd" class="outline-2">
<h2 id="orgad7cbbd">RSS Feed</h2>
<div class="outline-text-2" id="text-orgad7cbbd">
<p>
<a href="rss-feed-guide.html">RSS feeds</a> are generated with my custom generator <a href="https://github.com/San7o/tiny-rss">tiny-rss</a>.
I consider this still experimental so expect lots of changes and random
feeds.
</p>

<p>
If you still want to subscribe, at your own risk, currently those are
the available feeds:
</p>
<ul class="org-ul">
<li><a href="feeds/feedSurroundings.rss">Surroundings</a>: feed for the Surrounding series, described <a href="reading/surroundings/surroundings.html">here</a>.</li>
<li><a href="feeds/feedEphemeris.rss">Ephemeris</a>: feed for my public diary described <a href="ephemeris/ephemeris.html">here</a>.</li>
<li><a href="./feeds/feedProgramming.rss">Programming</a>: programming notes.</li>
</ul>

<hr />

<p>
Travel: <a href="index.html">Giovanni's Diary</a>, <a href="theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
